// Подключение основного файла стилей
import "../scss/style.scss";

// ========================================================================================================================================================================================================================================================
import { isWebp, menuInit } from "./files/functions.js";

/* Проверка поддержки webp, добавление класса webp или no-webp для HTML */
/* (i) необходимо для корректного отображения webp из css  */
isWebp();
/* Модуль для работы с меню (Бургер) */
menuInit();


/* Подключаем файлы со своим кодом */
import "./files/script.js";
//============================================================================================================================================================================================================================================